public_html/Books Review/The Unix Programming Environment/Errata for The Unix Programming Environment.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Errata for The Unix Programming Environment</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Errata for The Unix Programming Environment"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-08 09:20:46 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Errata for The Unix Programming Environment</h1>

<p><a href="http://netlib.bell-labs.com/cm/cs/upe/errata.html">http://netlib.bell-labs.com/cm/cs/upe/errata.html</a>
</p>
<p>
In some printing, over-zealous printers whited out critical characters like periods, back-quotes, and the like in the belief that they were fly-specks. The discussion of shell quoting conventions in such copies will be challenging.
</p>
<p>
14, 1/3 down: "least recent use" should be "least recent modification".
</p>
<p>
44, line -4: "system" should be "program".
</p>
<p>
58, last line: "directory" should be "directory entry".
</p>
<p>
70, line 4: "an fascinating" should be "a fascinating".
</p>
<p>
81, near bottom: echo $PATH does not print PATH=.
</p>
<p>
92, "the ed's ! command" should be "ed's ! command".
</p>
<p>
103, 1/3 down: "which when applied to the output&hellip;".
</p>
<p>
104, below output: "the shell protects the patterns from interpretation&hellip;".
</p>
<p>
121, first program: test if (NF &gt; 0) is unnecessary.
</p>
<p>
124, line -9: should be "After the files have been read".
</p>
<p>
161, middle: for i is the same as for i in "$@"; blanks in argument are not treated specially, &hellip;".
</p>
<p>
178, else clause: the value of argv<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup> is wrong if there was a -s argument.
</p>
<p>
183, middle: clobbers a real character if the line is too long; this also appears on 187 and 191.
</p>
<p>
184, first sentence: "The file pointer tty &hellip;".
</p>
<p>
184, middle: This also requires changing PAGESIZE to pagelen throughout.
</p>
<p>
198, top: missing declarations of n, though it compiled anyway. Also, the temporary files are left in the current directory.
</p>
<p>
206, 3/4 down: Unlink removes the name; the file goes away if this is the last link.
</p>
<p>
209, line -3: "file" is more accurately "file name".
</p>
<p>
234, line -5: syntax error is on line 5. Similarly, line 2 on page 240.
</p>
<p>
247: line -11: "easy to change the symbol table&hellip;".
</p>
<p>
251, middle: "when the context is a perfectly legal one&hellip;".
</p>
<p>
256, end of program: the comment "everything else" should be on the next line.
</p>
<p>
272, line -10: "when a statement &hellip;".
</p>
<p>
278, second code: int (**defn)().
</p>
<p>
279, line 5: delete (Inst) cast.
</p>
<p>
325, v command: "Print all non-empty lines."
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> DEFINITION NOT FOUND: 0
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-08 09:20:46 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
